# Задание 1: Объединение и сортировка списков
#
# У вас есть два списка чисел:
#
# list1 = [5, 8, 12, 3, 9]
# list2 = [7, 2, 10, 6, 4]
#
# Объедините оба списка в один.
# Отсортируйте итоговый список по возрастанию.
# Удалите все чётные числа из списка.
# Ожидаемый результат: После выполнения всех шагов итоговый список должен содержать только
# нечётные числа в отсортированном порядке.
def task1():
    list1 = [5, 8, 12, 3, 9]
    list2 = [7, 2, 10, 6, 4]
    # list3 = list1 + list2
    # print(list3)
    # sort = sorted(list3)
    # print(sort)
    # result=[]
    # for item in sort:
    #     if item%2==1:
    #         result.append(item)
    # print(result)
    new_list = sorted([item for item in list1+list2 if item%2!=0])
                      # ['элемент для элемента в списке(в множестве) при условии что...']
    print(new_list)

if __name__ == '__main__':
    task1()