# Клиент покупает кофе в кафе. За каждые 6 чашек, 1 чашка даётся в качестве бонуса.
#
# Задача: запросить у пользователя кол-во чашек на покупку, вычислить полагающееся кол-во
# бонусных чашек кофе и вывести это число на консоль.
def bonus_cups():
    total_cups = int(input("Введите количество чаше кофе: "))
    bonus_cups = total_cups // 6
    print(bonus_cups)

if __name__ == '__main__':
    bonus_cups()

