# Разделение кортежа на переменные и пересоздание кортежа
#
# Дан кортеж с координатами:
# coordinates = (10, 20, 30)
#
# Присвойте значения этого кортежа трём отдельным переменным: x, y, z.
# Выведите значения переменных.
# Создайте новый кортеж с новыми значениями переменных, например, увеличьте каждое из значений на 10.
#
# Ожидаемый результат:
# Отобразите значения переменных x, y, z после их присвоения.
# После этого выведите новый кортеж с увеличенными значениями, например, (20, 30, 40).
def task8():
    x, y, z = (10, 20, 30)
    print("x:", x)
    print("y:", y)
    print("z:", z)
    new_coordinates = (x + 10, y + 10, z + 10)
    print(new_coordinates)

    # посмотреть видосик еще раз

if __name__ == '__main__':
    task8()

