# 8.На ферме есть куры, коровы и свиньи. У курицы две ноги, у свиньи - четыре, у коровы - четыре.
# Запросить у пользователя (фермера) ввод кол-ва кур, свиней и коров, просуммировать кол-во ног всех
# животных и вывести результат на консоль.
def farm_leg_count():
    chickens = int(input("Введите количество кур: "))
    cows = int(input("Введите количество коров: "))
    pigs = int(input("Введите количество свиней: "))
    total_leg_count = chickens * 2 + (cows + pigs) * 4
    print(total_leg_count)


if __name__ == '__main__':
    farm_leg_count()
