# Дано число с плавающей запятой:
# num = 5.6789
#
# Округлите число до двух знаков после запятой.
# Округлите число до ближайшего целого.
# Найдите целую и дробную часть числа по отдельности.
# Ожидаемый результат: Отобразите округлённое число до двух знаков, ближайшее целое,
# а также отдельно целую и дробную часть числа.
def task6():
    num = 5.6789
    num1 = round(num, 2)
    num2 = round(num)
    int_part = int(num)
    fractional_part = num - int_part
    # найти другой вариант решения для разделения целой и дробной части числа
    print(num1,num2,int_part,fractional_part, sep='  ')

if __name__ == '__main__':
    task6()