# Задание 12: Проверка подмножества
#
# Даны два множества. Необходимо проверить, является ли одно множество подмножеством другого. Также нужно определить, являются ли два множества равными.
#

def task12():

    set1 = {5, 4, 3, 2, 1}
    set2 = {3, 4, 5}

    subset_sets = set2.issubset(set1)
    # equal_sets = set1 == set2
    # if subset_sets:
    #     print('Второе ножество является подмножеством первого')
    # else:
    #     print('второе множество не является подмножеством первого')

    print('Второе множество является подмножеством первого') if subset_sets else print('второе множество не является подмножеством первого')
    # print(set1 == set2)
    return set1 == set2

if __name__ == "__main__":
    print(task12())

